Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/PluginAudio/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk, zh_hant_tw

source: An error occurred during data sync.
zh_hans: 数据同步过程中发生错误
zh_hant_hk: 數據同步過程中發生錯誤
zh_hant_tw: 資料同步過程中發生錯誤

source: An error occurred while initializing the app.
zh_hans: 应用初始化过程中发生错误
zh_hant_hk: 應用初始化過程中發生錯誤
zh_hant_tw: 應用初始化過程中發生錯誤

source: Audio Library Initialization Failed
zh_hans: 音频库初始化失败
zh_hant_hk: 音頻庫初始化失敗
zh_hant_tw: 音訊庫初始化失敗

source: Audio not found: %@
zh_hans: 音频未找到: %@
zh_hant_hk: 音頻未找到: %@
zh_hant_tw: 音訊未找到: %@

source: Audio playback
zh_hans: 音频播放功能
zh_hant_hk: 音頻播放功能
zh_hant_tw: 音訊播放功能

source: Audio plugin host configuration is incomplete
zh_hans: 音频插件宿主配置未完成
zh_hant_hk: 音頻插件宿主配置未完成
zh_hant_tw: 音訊外掛宿主配置未完成

source: Basic Operations
zh_hans: 基本操作
zh_hant_hk: 基本操作
zh_hant_tw: 基本操作

source: Check app settings or reinstall the app.
zh_hans: 请检查应用设置或重新安装
zh_hant_hk: 請檢查應用設置或重新安裝
zh_hant_tw: 請檢查應用設定或重新安裝

source: Check disk space and access permissions.
zh_hans: 请检查磁盘空间和访问权限
zh_hant_hk: 請檢查磁盤空間和訪問權限
zh_hant_tw: 請檢查磁碟空間和訪問許可權

source: Check disk space and permissions.
zh_hans: 请检查磁盘空间和权限
zh_hant_hk: 請檢查磁盤空間和權限
zh_hant_tw: 請檢查磁碟空間和許可權

source: Check file permissions and disk status.
zh_hans: 请检查文件权限和磁盘状态
zh_hant_hk: 請檢查文件權限和磁盤狀態
zh_hant_tw: 請檢查檔案許可權和磁碟狀態

source: Check file permissions or close related apps.
zh_hans: 请检查文件权限或关闭相关应用
zh_hant_hk: 請檢查文件權限或關閉相關應用
zh_hant_tw: 請檢查檔案許可權或關閉相關應用

source: Check the app startup flow.
zh_hans: 请检查应用启动流程
zh_hant_hk: 請檢查應用啓動流程
zh_hant_tw: 請檢查應用啟動流程

source: Check the data source or download again.
zh_hans: 请检查数据源或重新下载
zh_hant_hk: 請檢查數據源或重新下載
zh_hant_tw: 請檢查資料來源或重新下載

source: Check the disk path and access permissions.
zh_hans: 请检查磁盘路径和访问权限
zh_hant_hk: 請檢查磁盤路徑和訪問權限
zh_hant_tw: 請檢查磁碟路徑和訪問許可權

source: Check the network connection or try again later.
zh_hans: 请检查网络连接或稍后重试
zh_hant_hk: 請檢查網絡連接或稍後重試
zh_hant_tw: 請檢查網路連線或稍後重試

source: Check the network connection.
zh_hans: 请检查网络连接
zh_hant_hk: 請檢查網絡連接
zh_hant_tw: 請檢查網路連線

source: Check the playlist or switch to another playback mode.
zh_hans: 请检查播放列表或切换到其他播放模式
zh_hant_hk: 請檢查播放列表或切換到其他播放模式
zh_hant_tw: 請檢查播放列表或切換到其他播放模式

source: Check whether the file exists or sync again.
zh_hans: 请检查文件是否存在或重新同步
zh_hant_hk: 請檢查文件是否存在或重新同步
zh_hant_tw: 請檢查檔案是否存在或重新同步

source: Click any music to start playing.
zh_hans: 点击任意音乐开始播放。
zh_hant_hk: 按一下任何音樂即可開始播放。
zh_hant_tw: 按一下任何音樂即可開始播放。

source: Configuration error [%@]: %@
zh_hans: 配置错误 [%@]: %@
zh_hant_hk: 配置錯誤 [%@]: %@
zh_hant_tw: 配置錯誤 [%@]: %@

source: Core Capabilities
zh_hans: 核心能力
zh_hant_hk: 核心能力
zh_hant_tw: 核心能力

source: Database not found
zh_hans: 数据库未找到
zh_hant_hk: 數據庫未找到
zh_hant_tw: 資料庫未找到

source: Database operation failed [%@]: %@
zh_hans: 数据库操作失败 [%@]: %@
zh_hant_hk: 數據庫操作失敗 [%@]: %@
zh_hant_tw: 資料庫操作失敗 [%@]: %@

source: Delete operation failed
zh_hans: 删除操作失败
zh_hant_hk: 刪除操作失敗
zh_hant_tw: 刪除操作失敗

source: Disk access failed [%@]: %@
zh_hans: 磁盘访问失败 [%@]: %@
zh_hant_hk: 磁盤訪問失敗 [%@]: %@
zh_hant_tw: 磁碟訪問失敗 [%@]: %@

source: Download again or choose another audio file.
zh_hans: 请重新下载或选择其他音频文件
zh_hant_hk: 請重新下載或選擇其他音頻文件
zh_hant_tw: 請重新下載或選擇其他音訊檔案

source: Failed to delete data: %@
zh_hans: 数据删除失败: %@
zh_hant_hk: 數據刪除失敗: %@
zh_hant_tw: 資料刪除失敗: %@

source: Failed to save data: %@
zh_hans: 数据保存失败: %@
zh_hant_hk: 數據保存失敗: %@
zh_hant_tw: 資料儲存失敗: %@

source: Failed to toggle like status: %@
zh_hans: 切换喜欢状态失败: %@
zh_hant_hk: 切換喜歡狀態失敗: %@
zh_hant_tw: 切換喜歡狀態失敗: %@

source: File is corrupted: %@
zh_hans: 文件损坏: %@
zh_hant_hk: 文件損壞: %@
zh_hant_tw: 檔案損壞: %@

source: File monitoring failed: %@
zh_hans: 文件监控失败: %@
zh_hant_hk: 文件監控失敗: %@
zh_hant_tw: 檔案監控失敗: %@

source: File system error [%@]: %@
zh_hans: 文件系统错误 [%@]: %@
zh_hant_hk: 文件系統錯誤 [%@]: %@
zh_hant_tw: 檔案系統錯誤 [%@]: %@

source: File system permissions are insufficient or the file is in use.
zh_hans: 文件系统权限不足或文件被占用
zh_hant_hk: 文件系統權限不足或文件被佔用
zh_hant_tw: 檔案系統許可權不足或檔案被佔用

source: Initialization failed: %@
zh_hans: 初始化失败: %@
zh_hant_hk: 初始化失敗: %@
zh_hant_tw: 初始化失敗: %@

source: Initializing...
zh_hans: 正在初始化...
zh_hant_hk: 正在初始化...
zh_hant_tw: 正在初始化...

source: Invalid data: %@
zh_hans: 数据无效: %@
zh_hant_hk: 數據無效: %@
zh_hant_tw: 資料無效: %@

source: Invalid state, expected: %@, actual: %@
zh_hans: 状态无效，期望: %@，实际: %@
zh_hant_hk: 狀態無效，期望: %@，實際: %@
zh_hant_tw: 狀態無效，期望: %@，實際: %@

source: Manage, browse, and play local music files
zh_hans: 管理、浏览与播放本地音乐文件。
zh_hant_hk: 管理、瀏覽與播放本機音樂檔案。
zh_hant_tw: 管理、瀏覽與播放本機音樂檔案。

source: Manages local music files and browses by category.
zh_hans: 管理本地音乐文件并分类浏览。
zh_hant_hk: 管理本機音樂檔案並分類瀏覽。
zh_hant_tw: 管理本機音樂檔案並分類瀏覽。

source: Media Library
zh_hans: 媒体库
zh_hant_hk: 媒體庫
zh_hant_tw: 媒體庫

source: Media Library: manages local music files and browses by category.
zh_hans: 媒体库：管理本地音乐文件并分类浏览。
zh_hant_hk: 媒體庫：管理本機音樂檔案並分類瀏覽。
zh_hant_tw: 媒體庫：管理本機音樂檔案並分類瀏覽。

source: Music
zh_hans: 音乐
zh_hant_hk: 音樂
zh_hant_tw: 音樂

source: Music Library
zh_hans: 音乐库
zh_hant_hk: 音樂庫
zh_hant_tw: 音樂庫

source: Network error [%@]: %@
zh_hans: 网络错误 [%@]: %@
zh_hant_hk: 網絡錯誤 [%@]: %@
zh_hant_tw: 網路錯誤 [%@]: %@

source: No next audio file
zh_hans: 没有下一个音频文件
zh_hant_hk: 沒有下一個音頻文件
zh_hant_tw: 沒有下一個音訊檔案

source: No previous audio file
zh_hans: 没有上一个音频文件
zh_hant_hk: 沒有上一個音頻文件
zh_hant_tw: 沒有上一個音訊檔案

source: Notes
zh_hans: 说明
zh_hant_hk: 說明
zh_hant_tw: 說明

source: Opens the music library scene to browse all music.
zh_hans: 打开音乐库场景，浏览全部音乐。
zh_hant_hk: 開啟音樂庫場景，瀏覽全部音樂。
zh_hant_tw: 開啟音樂庫場景，瀏覽全部音樂。

source: Overview
zh_hans: 概述
zh_hant_hk: 概述
zh_hant_tw: 概述

source: Play
zh_hans: 播放
zh_hant_hk: 播放
zh_hant_tw: 播放

source: Play: starts playback from the music library.
zh_hans: 播放：从媒体库发起播放。
zh_hant_hk: 播放：從媒體庫開始播放。
zh_hant_tw: 播放：從媒體庫開始播放。

source: Please set the media library storage location first
zh_hans: 请先设置媒体仓库的存储位置
zh_hant_hk: 請先設定媒體庫的儲存位置
zh_hant_tw: 請先設定媒體庫的儲存位置

source: Plugin
zh_hans: 插件
zh_hant_hk: 外掛程式
zh_hant_tw: 外掛程式

source: Quickly locate music by name.
zh_hans: 按名称快速定位音乐。
zh_hant_hk: 依名稱快速定位音樂。
zh_hant_tw: 依名稱快速定位音樂。

source: Restart the app or check system permissions.
zh_hans: 请重启应用或检查系统权限
zh_hant_hk: 請重啓應用或檢查系統權限
zh_hant_tw: 請重啟應用或檢查系統許可權

source: Search
zh_hans: 搜索
zh_hant_hk: 搜尋
zh_hant_tw: 搜尋

source: Search: quickly find music by name.
zh_hans: 搜索：按名称快速定位音乐。
zh_hant_hk: 搜尋：按名稱快速定位音樂。
zh_hant_tw: 搜尋：按名稱快速定位音樂。

source: Set the media library storage location first.
zh_hans: 请先设置媒体仓库的存储位置
zh_hant_hk: 請先設置媒體倉庫的存儲位置
zh_hant_tw: 請先設定媒體倉庫的儲存位置

source: Starts playback from the music library.
zh_hans: 从媒体库发起播放。
zh_hant_hk: 從媒體庫開始播放。
zh_hant_tw: 從媒體庫開始播放。

source: Storage location has changed
zh_hans: 存储位置发生了变化
zh_hant_hk: 存儲位置發生了變化
zh_hant_tw: 儲存位置發生了變化

source: Storage location not set
zh_hans: 存储位置未设置
zh_hant_hk: 儲存位置未設定
zh_hant_tw: 儲存位置未設定

source: Storage Location Not Set
zh_hans: 存储位置未设置
zh_hant_hk: 存儲位置未設置
zh_hant_tw: 儲存位置未設定

source: Sync failed: %@
zh_hans: 同步失败: %@
zh_hant_hk: 同步失敗: %@
zh_hant_tw: 同步失敗: %@

source: The app has not injected database and storage path configuration.
zh_hans: 应用尚未注入数据库和存储路径配置
zh_hant_hk: 應用尚未注入數據庫和存儲路徑配置
zh_hant_tw: 應用尚未注入資料庫和儲存路徑配置

source: The app state does not match the expected state.
zh_hans: 应用状态与预期不符
zh_hant_hk: 應用狀態與預期不符
zh_hant_tw: 應用狀態與預期不符

source: The audio file may be corrupted or incomplete.
zh_hans: 音频文件可能已损坏或不完整
zh_hant_hk: 音頻文件可能已損壞或不完整
zh_hant_tw: 音訊檔案可能已損壞或不完整

source: The current audio is the first item in the playlist.
zh_hans: 当前音频是播放列表中的第一个
zh_hant_hk: 當前音頻是播放列表中的第一個
zh_hant_tw: 當前音訊是播放列表中的第一個

source: The current audio is the last item in the playlist.
zh_hans: 当前音频是播放列表中的最后一个
zh_hant_hk: 當前音頻是播放列表中的最後一個
zh_hant_tw: 當前音訊是播放列表中的最後一個

source: The data deletion operation failed.
zh_hans: 数据删除操作失败
zh_hant_hk: 數據刪除操作失敗
zh_hant_tw: 資料刪除操作失敗

source: The data format is not as expected.
zh_hans: 数据格式不符合预期
zh_hant_hk: 數據格式不符合預期
zh_hant_tw: 資料格式不符合預期

source: The data persistence operation failed.
zh_hans: 数据持久化操作失败
zh_hant_hk: 數據持久化操作失敗
zh_hant_tw: 資料持久化操作失敗

source: The database connection was lost or the database file is corrupted.
zh_hans: 数据库连接丢失或数据库文件损坏
zh_hant_hk: 數據庫連接丟失或數據庫文件損壞
zh_hant_tw: 資料庫連線丟失或資料庫檔案損壞

source: The database operation failed.
zh_hans: 数据库操作执行失败
zh_hant_hk: 數據庫操作執行失敗
zh_hant_tw: 資料庫操作執行失敗

source: The database update operation failed.
zh_hans: 数据库更新操作执行失败
zh_hant_hk: 數據庫更新操作執行失敗
zh_hant_tw: 資料庫更新操作執行失敗

source: The file system monitoring service failed.
zh_hans: 文件系统监控服务失败
zh_hant_hk: 文件系統監控服務失敗
zh_hant_tw: 檔案系統監控服務失敗

source: The file system operation failed.
zh_hans: 文件系统操作失败
zh_hant_hk: 文件系統操作失敗
zh_hant_tw: 檔案系統操作失敗

source: The music library depends on a local storage location; configure it in Settings first.
zh_hans: 音乐库依赖本地存储位置，需先在设置中配置存储。
zh_hant_hk: 音樂庫依賴本機儲存位置，需先在設定中設定儲存。
zh_hant_tw: 音樂庫依賴本機儲存位置，需先在設定中設定儲存。

source: The network connection or data transfer failed.
zh_hans: 网络连接或数据传输失败
zh_hant_hk: 網絡連接或數據傳輸失敗
zh_hant_tw: 網路連線或資料傳輸失敗

source: The requested audio file does not exist.
zh_hans: 请求的音频文件不存在
zh_hant_hk: 請求的音頻文件不存在
zh_hant_tw: 請求的音訊檔案不存在

source: The specified disk location cannot be accessed.
zh_hans: 无法访问指定的磁盘位置
zh_hant_hk: 無法訪問指定的磁盤位置
zh_hant_tw: 無法訪問指定的磁碟位置

source: The specified disk path does not exist or cannot be accessed.
zh_hans: 指定的磁盘路径不存在或无法访问
zh_hant_hk: 指定的磁盤路徑不存在或無法訪問
zh_hant_tw: 指定的磁碟路徑不存在或無法訪問

source: There is a problem with the app configuration.
zh_hans: 应用配置存在问题
zh_hant_hk: 應用配置存在問題
zh_hant_tw: 應用配置存在問題

source: Try again later.
zh_hans: 请稍后重试
zh_hant_hk: 請稍後重試
zh_hant_tw: 請稍後重試

source: Try reopening the app or checking media library settings.
zh_hans: 请尝试重新打开应用或检查媒体仓库设置
zh_hant_hk: 請嘗試重新打開應用或檢查媒體倉庫設置
zh_hant_tw: 請嘗試重新開啟應用或檢查媒體倉庫設定

source: Try restarting the app or resetting the database.
zh_hans: 请尝试重启应用或重置数据库
zh_hant_hk: 請嘗試重啓應用或重置數據庫
zh_hant_tw: 請嘗試重啟應用或重置資料庫

source: Try restarting the app or syncing again.
zh_hans: 请尝试重启应用或重新同步
zh_hant_hk: 請嘗試重啓應用或重新同步
zh_hant_tw: 請嘗試重啟應用或重新同步

source: Try restarting the app.
zh_hans: 请尝试重启应用
zh_hant_hk: 請嘗試重啓應用
zh_hant_tw: 請嘗試重啟應用

source: Try the operation again.
zh_hans: 请尝试重新操作
zh_hant_hk: 請嘗試重新操作
zh_hant_tw: 請嘗試重新操作

source: Type
zh_hans: 类型
zh_hant_hk: 類型
zh_hant_tw: 類型

source: Unable to access disk
zh_hans: 无法访问磁盘
zh_hant_hk: 無法訪問磁盤
zh_hant_tw: 無法訪問磁碟

source: Use the search field to filter music by name.
zh_hans: 使用搜索框按名称过滤音乐。
zh_hant_hk: 使用搜尋框依名稱篩選音樂。
zh_hant_tw: 使用搜尋框依名稱篩選音樂。

source: Version
zh_hans: 版本
zh_hant_hk: 版本
zh_hant_tw: 版本
